In [1]:
import pandas as pd
data=pd.read_csv("cse.csv")
data

  NAME  AGE  SALARY
0  abc   12   10000
1  xyz   13   20000
2  pqr   35   30000
3  lmn   45   40000
4  def   50   50000
5  hij   65   60000

# HEAD()

In [2]:
data.head(4)

  NAME  AGE  SALARY
0  abc   12   10000
1  xyz   13   20000
2  pqr   35   30000
3  lmn   45   40000

# TAIL()

In [3]:
data.tail(3)

  NAME  AGE  SALARY
3  lmn   45   40000
4  def   50   50000
5  hij   65   60000

In [4]:
data["AGE"]

0    12
1    13
2    35
3    45
4    50
5    65
Name: AGE, dtype: int64

In [5]:
type(data)

pandas.core.frame.DataFrame

# INFO()

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
NAME      6 non-null object
AGE       6 non-null int64
SALARY    6 non-null int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [9]:
data[["NAME","AGE"]]

  NAME  AGE
0  abc   12
1  xyz   13
2  pqr   35
3  lmn   45
4  def   50
5  hij   65

In [11]:
data[data["AGE"]>30]

  NAME  AGE  SALARY
2  pqr   35   30000
3  lmn   45   40000
4  def   50   50000
5  hij   65   60000

In [12]:
data["AGE"].max()

65

In [13]:
data["AGE"]>30

0    False
1    False
2     True
3     True
4     True
5     True
Name: AGE, dtype: bool